



"""File Handling এর মাধ্যমে ফাইল তৈরি, ফাইল পড়া, ফাইলে লেখা, এবং ফাইল মুছে ফেলার কাজ করি...
   Create files, read files, write to files, and delete files.
   
   
                  Syntax..
>>> ফাইল খোলার জন্য open() ফাংশন ব্যবহার করা হয় 
>>> বন্ধ করার জন্য close() ফাংশন ব্যবহার করা হয়।

                     OR/
>>> ফাইল খোলার জন্য with স্টেটমেন্ট  ব্যবহার করা হয়|
 এটি স্বয়ংক্রিয়ভাবে ফাইল বন্ধ করে দেয় যখন ব্লকের কাজ শেষ হয়। 

>>> ফাইল DELETE  জন্য os মডিউল ব্যবহার করা হয়।


 
        ফাইল খোলার মোড--->
    --------------------------
1.Read:   "r": পড়ার জন্য (ডিফল্ট মোড) 

2.Write:  "w": লেখার জন্য (ফাইলটি আগেই থাকলে এটি মুছে ফেলে নতুন করে তৈরি করবে)

3.Append: "a": যোগ করার জন্য (ফাইলের শেষে লেখা যোগ করবে)

4.Binary: "b": বাইনারি মোডে

5.Text:   "t": টেক্সট মোডে (ডিফল্ট মোড)

6."x":         এক্সক্লুসিভ ক্রিয়েট মোড (ফাইলটি আগেই থাকলে ব্যর্থ হবে)
7.+
"""

# "w" মোডে ফাইল খোলা (লেখার জন্য)
file = open("program.txt", "w")
file.write("This is a test file.\n")
file.write("Writing another line in the file.")
file.close()
